# Ultralytics YOLO 🚀, GPL-3.0 license
# YOLOv8-pose keypoints/pose estimation model. For Usage examples see https://docs.ultralytics.com/tasks/pose

# Parameters
nc: 1  # number of classes
kpt_shape: [5, 3]  # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# custom backbone
# custom backbone
backbone:
  # [from, number, module, args]
  [ [ -1, 1, StemBlock, [16, 3, 2] ],    # 0-P2/4
    [ -1, 1, Shuffle_Block, [48, 2]], # 1-P3/8
    [ -1, 2, Shuffle_Block, [48, 1]], # 2
    [ -1, 1, Shuffle_Block, [96, 2]], # 3-P4/16
    [ -1, 5, Shuffle_Block, [96, 1]], # 4
    [ -1, 1, Shuffle_Block, [192, 2]], # 5-P5/32
    [ -1, 2, Shuffle_Block, [192, 1]], # 6
    [ -1, 1, SPPF, [192, 5]],
  ]

# v5lite-e head
head:
  [ [ -1, 1, Conv, [48, 1, 1]],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest']],
    [[ -1, 4], 1, Concat, [1]],  # cat backbone P4
    [ -1, 1, DWConvblock, [48, 3, 1]],  # 11

    [ -1, 1, Conv, [48, 1, 1]],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest']],
    [[ -1, 2], 1, Concat, [1]],  # cat backbone P3
    [ -1, 1, DWConvblock, [48, 3, 1] ],  # 15 (P3/8-small)

    [-1, 1, DWConvblock, [48, 3, 2]],
    [[ -1, 12], 1, ADD, [1]],  # cat head P4
    [ -1, 1, DWConvblock, [48, 3, 1]],  # 18 (P4/16-medium)

    [ -1, 1, DWConvblock, [48, 3, 2]],
    [[ -1, 8], 1, ADD, [1]],  # cat head P5
    [ -1, 1, DWConvblock, [48, 3, 1]],  # 21 (P5/32-large)
    [[ 15, 18, 21], 1, Pose, [nc, kpt_shape]],  # Detect(P3, P4, P5)
  ]
